src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <comment>Заявки на поставку предметов снабжения</comment>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
    </type>
  </attributes>
  <attributes>
    <name>Корабли</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозиций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроектаВТС</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНазначенияДЗО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительДЗО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженаССайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаТекущегоЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросТКПRFP</name>
    <type>
      <types>DocumentRef.ЗапросТКПRFP</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециалистДЭ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Удалить_ЭтапыВыполненияЗаявки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзделияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительДЗО</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОСК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИерархииИзделия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийЭтап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТекущегоЭтапа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаТекущегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСледующегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГодаЧерез1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЦеновойИнформации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеЦенообразования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабженияИсходный</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыВыполненияСпецификации</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Корабль</name>
      <type>
        <types>CatalogRef.ПроектыКораблей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИсполнителиДЗОЗаявок/ИсполнителиДЗОЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнителиДЗОЗаявок</name>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсполнительДЗО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Заявка/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриЗаписи(Отказ)
	
	РезультатЗаписиИсполнителейДЗО = ЗаписатьИсполнителейДЗО();
	
	Если Не ЗначениеЗаполнено(Корабли) И Проекты.Количество() > 0 Тогда
		
		Корабли = СтрСоединить(Проекты.ВыгрузитьКолонку("Корабль"), ", "); //для вывода в динамические списки и отчеты
		
	КонецЕсли;
	
КонецПроцедуры	//ПриЗаписи

Процедура ПередУдалением(Отказ)
	
	НаборЗаписей = РегистрыСведений.ИсполнителиДЗОЗаявок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;	
	
КонецПроцедуры	//ПередУдалением

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// ++ 19.07.2018 10:51:51 Базунов Д.А. Задача: 
	// Для РДВТС убираем проверку реквизитов в ТЧ спецификация
	//Если РольДоступна("РуководительДепартаментаВТС") ИЛИ РольДоступна("РуководительПроектаДепартаментаВТС") Тогда
	//	
	//	МассивУдаляемых = Новый Массив;
	//	
	//	Для каждого ТекРеквизит Из ПроверяемыеРеквизиты Цикл
	//		
	//		Если СтрНайти(ТекРеквизит, "Спецификация") > 0 Тогда
	//			МассивУдаляемых.Добавить(ТекРеквизит);
	//		КонецЕсли;
	//		
	//	КонецЦикла; 
	//	
	//	Для каждого УдаляемыйРеквизит Из МассивУдаляемых Цикл
	//		
	//		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти(УдаляемыйРеквизит));
	//		
	//	КонецЦикла; 
	//	
	//КонецЕсли; 
	// -- 19.07.2018 10:51:51 Базунов Д.А. Задача:
	
КонецПроцедуры //ОбработкаПроверкиЗаполнения

Функция ЗаписатьИсполнителейДЗО()
	
	Результат = Новый Структура("Выполнено, Описание", Ложь, "");
	
	Если Спецификация.Количество() = 0 Тогда
		
		Результат.Выполнено = Истина;
		Возврат Результат;
		
	КонецЕсли;
	
	ТЗИсполнителиДЗО = Новый ТаблицаЗначений;
	ТЗИсполнителиДЗО.Колонки.Добавить("Заявка", Новый ОписаниеТипов("ДокументСсылка.Заявка"));
	ТЗИсполнителиДЗО.Колонки.Добавить("ИсполнительДЗО", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Для каждого Строка Из Спецификация Цикл
		
		Если ЗначениеЗаполнено(Строка.ИсполнительДЗО) И ТЗИсполнителиДЗО.Найти(Строка.ИсполнительДЗО, "ИсполнительДЗО") = Неопределено Тогда
			
			НоваяСтрока = ТЗИсполнителиДЗО.Добавить();
			НоваяСтрока.Заявка = Ссылка;
			НоваяСтрока.ИсполнительДЗО = Строка.ИсполнительДЗО;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если ТЗИсполнителиДЗО.Количество() = 0 Тогда
		
		Результат.Выполнено = Истина;
		Возврат Результат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗИсполнителиДЗО.Заявка,
	|	ТЗИсполнителиДЗО.ИсполнительДЗО
	|ПОМЕСТИТЬ ВТ_ИсполнителиДЗО
	|ИЗ
	|	&ТЗИсполнителиДЗО КАК ТЗИсполнителиДЗО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсполнителиДЗО.ИсполнительДЗО КАК ИсполнительДЗОЗаявки,
	|	ИсполнителиДЗОЗаявок.ИсполнительДЗО КАК ИсполнительДЗОРегистра
	|ИЗ
	|	ВТ_ИсполнителиДЗО КАК ВТ_ИсполнителиДЗО
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиДЗОЗаявок КАК ИсполнителиДЗОЗаявок
	|		ПО ВТ_ИсполнителиДЗО.Заявка = ИсполнителиДЗОЗаявок.Заявка
	|			И ВТ_ИсполнителиДЗО.ИсполнительДЗО = ИсполнителиДЗОЗаявок.ИсполнительДЗО
	|ГДЕ
	|	(ВТ_ИсполнителиДЗО.ИсполнительДЗО ЕСТЬ NULL 
	|			ИЛИ ИсполнителиДЗОЗаявок.ИсполнительДЗО ЕСТЬ NULL )";
	
	Запрос.УстановитьПараметр("ТЗИсполнителиДЗО", ТЗИсполнителиДЗО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Результат.Выполнено = Истина;
		Возврат Результат;
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИсполнителиДЗОЗаявок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	ЕстьЗаписи = НаборЗаписей.Количество() > 0;
	
	Если ЕстьЗаписи Тогда
		
		НаборЗаписей.Очистить();	
		
	КонецЕсли;
	
	НаборЗаписей.Загрузить(ТЗИсполнителиДЗО);
	
	Попытка
		
		НаборЗаписей.Записать(ЕстьЗаписи);	
		
	Исключение
		
		Результат.Описание = ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	Результат.Выполнено = Истина;
	Возврат Результат;
	
КонецФункции	//ЗаписатьИсполнителейДЗО
